class S模式:
	def __init__(self, a文本: str, a路径: str):
		self.m文本 = a文本	#e.text
		self.m路径 = a路径	#xpath
	@staticmethod
	def fc顶部栏(a文本: str, i: int):
		return S模式(a文本, f"/html/body/div[1]/div[2]/span[{i}]")
	@staticmethod
	def fc左侧栏(a文本: str, i: int, j: int = 0, k: int = 0):
		if j:
			if k:	#左侧3级
				p = f"/html/body/div[2]/div/div/div[1]/div/div/div[1]/div/div[2]/div[2]/ul/li[{i}]/ul/li[{j}]/ul/li[{k}]/a"
			else:	#左侧2级
				p = f"/html/body/div[2]/div/div/div[1]/div/div/div[1]/div/div[2]/div[2]/ul/li[{i}]/ul/li[{j}]/a/em"
		else:	#左侧1级
			p = f"/html/body/div[2]/div/div/div[1]/div/div/div[1]/div/div[2]/div[2]/ul/li[{i}]/a/em"
		return S模式(a文本, p)
	@staticmethod
	def fc标签栏(a文本: str, i: int):	#子页面的上方
		p = f"/html/body/div[2]/div/div/div[2]/div/div[2]/div[2]/div[1]/div/div/div/div/div/div/div/div/div[1]/div[1]/ul/li[{i}]/a[2]/em/span/span"
		return S模式(a文本, p)
	@staticmethod
	def fc工具栏(a文本: str, i: int):	#工具栏靠左的按钮
		p = f"/html/body/div[2]/div/div/div[2]/div/div[2]/div[2]/div[1]/div/div/div/div/div/div/div/div/div[2]/div/div/div/div/div/div/div/div[1]/div/div[1]/div/table/tbody/tr/td[1]/table/tbody/tr/td[{i}]/table/tbody/tr[2]/td[2]/em/button/span"
		return S模式(a文本, p)
class C路径af8035:
	"""适用于：v8.0.35~"""
	#xpath从1开始
	c首页 = S模式.fc顶部栏("首页", 1)
	c安全运营 = S模式.fc顶部栏("安全运营", 2)
	c安全运营_安全运营中心 = S模式.fc左侧栏("安全运营中心", 1)
	c安全运营_业务安全 = S模式.fc左侧栏("业务安全", 2)
	c安全运营_用户安全 = S模式.fc左侧栏("用户安全", 3)
	c安全运营_专项防护 = S模式.fc左侧栏("专项防护", 4)
	c安全运营_专项防护_业务资产管理 = S模式.fc左侧栏("业务资产管理", 4, 1)
	c安全运营_专项防护_勒索专项防护 = S模式.fc左侧栏("勒索专项防护", 4, 2)
	c安全运营_专项防护_主动诱捕总览 = S模式.fc左侧栏("主动诱捕总览", 4, 3)
	c安全运营_专项防护_云端黑客IP防护 = S模式.fc左侧栏("云端黑客IP防护", 4, 4)
	c安全运营_专项防护_账号安全专项防护 = S模式.fc左侧栏("账号安全专项防护", 4, 5)
	c安全运营_热点事件预警 = S模式.fc左侧栏("热点事件预警", 5)
	c安全运营_黑白名单 = S模式.fc左侧栏("黑白名单", 6)
	c安全运营_黑白名单_黑名单 = S模式.fc左侧栏("黑名单", 6, 1)
	c安全运营_黑白名单_黑名单_永久封锁名单 = S模式.fc左侧栏("永久封锁名单", 6, 1, 1)
	c安全运营_黑白名单_黑名单_临时封锁名单 = S模式.fc左侧栏("临时封锁名单", 6, 1, 2)
	c安全运营_黑白名单_白名单 = S模式.fc左侧栏("黑名单", 6, 2)
	c安全运营_下一代安全体系 = S模式.fc左侧栏("黑白名单", 7)
	c安全运营_下一代安全体系_联动方案总览 = S模式.fc左侧栏("联动方案总览", 7, 1)
	c安全运营_下一代安全体系_网云联动 = S模式.fc左侧栏("网云联动", 7, 2)
	c安全运营_下一代安全体系_网云联动_网云接入设置 = S模式.fc左侧栏("网云接入设置", 7, 2, 1)
	c安全运营_下一代安全体系_网云联动_云鉴检测与防护 = S模式.fc左侧栏("云鉴检测与防护", 7, 2, 2)
	c安全运营_下一代安全体系_网云联动_门户网站保护 = S模式.fc左侧栏("门户网站保护", 7, 2, 3)
	c安全运营_下一代安全体系_网端联动 = S模式.fc左侧栏("网端联动", 7, 3)
	c安全运营_下一代安全体系_网端联动_网端接入设置 = 1
	c安全运营_下一代安全体系_网端联动_终端管理 = 2
	c安全运营_下一代安全体系_网端联动_联动日志 = 3
	c安全运营_下一代安全体系_蜜罐联动防护 = S模式.fc左侧栏("蜜罐联动防护", 7, 4)
	c安全运营_下一代安全体系_蜜罐联动防护_蜜罐接入设置 = 1
	c安全运营_下一代安全体系_蜜罐联动防护_蜜罐联动诱捕黑客IP = 2
	c安全运营_下一代安全体系_安全防护能力 = S模式.fc左侧栏("安全防护能力", 7, 5)
	c监控 = S模式.fc顶部栏("监控", 3)
	c监控_日志 = 1
	c监控_日志_安全日志 = 1
	c监控_日志_行为日志 = 2
	c监控_日志_系统日志 = 3
	c监控_会话 = 2
	c监控_会话_流量排行 = 1
	c监控_会话_异常流量 = 2
	c监控_会话_会话排行 = 3
	c监控_会话_流量管理状态 = 4
	c监控_统计 = 3
	c监控_统计_应用统计 = 1
	c监控_统计_流量统计 = 2
	c监控_报表 = 4
	c监控_报表_安全风险报表 = 1
	c监控_报表_报表订阅 = 2
	c监控_设置 = 5
	c策略 = S模式.fc顶部栏("监控", 4)
	c对象 = S模式.fc顶部栏("对象", 5)
	c网络 = S模式.fc顶部栏("网络", 6)
	c网络_接口 = S模式.fc左侧栏("接口", 1)
	c网络_接口_物理接口 = S模式.fc标签栏("物理接口", 1)
	c网络_接口_子接口 = S模式.fc标签栏("子接口", 2)
	c网络_接口_VLAN接口 = S模式.fc标签栏("VLAN接口", 3)
	c网络_接口_聚合接口 = S模式.fc标签栏("聚合接口", 4)
	c网络_接口_GRE隧道 = S模式.fc标签栏("GRE隧道", 5)
	c网络_接口_接口联动 = S模式.fc标签栏("接口联动", 6)
	c网络_区域 = S模式.fc左侧栏("区域", 2)
	c网络_路由 = S模式.fc左侧栏("路由", 3)
	c网络_路由_静态路由 = S模式.fc标签栏("静态路由", 1)
	c网络_路由_策略路由 = S模式.fc标签栏("策略路由", 2)
	c网络_路由_多播路由 = S模式.fc标签栏("多播路由", 3)
	c网络_路由_OSPF = S模式.fc标签栏("OSPF", 4)
	c网络_路由_RIP = S模式.fc标签栏("RIP", 5)
	c网络_路由_BGP = S模式.fc标签栏("BGP", 6)
	c网络_路由_查看路由 = S模式.fc标签栏("查看路由", 7)
	c网络_路由_路由测试 = S模式.fc标签栏("路由测试", 8)
	c网络_虚拟网线 = S模式.fc左侧栏("虚拟网线", 4)
	c网络_DNS = S模式.fc左侧栏("DNS", 5)
	c网络_DHCP = S模式.fc左侧栏("DHCP", 6)
	c网络_ARP = S模式.fc左侧栏("ARP", 7)
	c网络_高级网络 = S模式.fc左侧栏("高级网络", 8)
	c网络_SSLVPN = S模式.fc左侧栏("SSLVPN", 9)
	c网络_IPSecVPN = S模式.fc左侧栏("IPSecVPN", 10)
	c系统 = S模式.fc顶部栏("系统", 6)
	c系统_通用设置 = S模式.fc左侧栏("通用设置", 1)
	c系统_安全能力更新 = S模式.fc左侧栏("安全能力更新", 2)
	c系统_排障 = S模式.fc左侧栏("排障", 3)
	c系统_排障_故障排查 = S模式.fc左侧栏("故障排查", 3, 1)
	c系统_排障_分析工具 = S模式.fc左侧栏("分析工具", 3, 2)
	c系统_排障_分析工具_命令行工具 = S模式.fc标签栏("命令行工具", 1)
	c系统_排障_分析工具_抓包工具 = S模式.fc标签栏("抓包工具", 2)
	c系统_排障_分析工具_技术支持工具 = S模式.fc标签栏("技术支持工具", 3)
	c系统_排障_系统故障日志 = S模式.fc左侧栏("系统故障日志", 3, 3)
	c系统_SNMP = S模式.fc左侧栏("SNMP", 4)
	c系统_管理员账号 = S模式.fc左侧栏("管理员账号", 5)
	c系统_系统维护 = S模式.fc左侧栏("系统维护", 6)
	c系统_高可用性 = S模式.fc左侧栏("高可用性", 7)
	c系统_中台对接管理 = S模式.fc左侧栏("中台对接管理", 8)
class C模式af8035:
	c首页 = (C路径af8035.c首页,)
	c网络_接口_物理接口 = (C路径af8035.c网络, C路径af8035.c网络_接口, C路径af8035.c网络_接口_物理接口)
	c网络_接口_子接口 = (C路径af8035.c网络, C路径af8035.c网络_接口, C路径af8035.c网络_接口_子接口)
	c网络_接口_VLAN接口 = (C路径af8035.c网络, C路径af8035.c网络_接口, C路径af8035.c网络_接口_VLAN接口)
	c网络_接口_聚合接口 = (C路径af8035.c网络, C路径af8035.c网络_接口, C路径af8035.c网络_接口_聚合接口)
	c网络_接口_GRE隧道 = (C路径af8035.c网络, C路径af8035.c网络_接口, C路径af8035.c网络_接口_GRE隧道)
	c网络_接口_接口联动 = (C路径af8035.c网络, C路径af8035.c网络_接口, C路径af8035.c网络_接口_接口联动)
	c网络_路由_静态路由 = (C路径af8035.c网络, C路径af8035.c网络_路由, C路径af8035.c网络_路由_静态路由)
	c网络_路由_策略路由 = (C路径af8035.c网络, C路径af8035.c网络_路由, C路径af8035.c网络_路由_策略路由)
	c网络_路由_多播路由 = (C路径af8035.c网络, C路径af8035.c网络_路由, C路径af8035.c网络_路由_多播路由)
	c网络_路由_OSPF = (C路径af8035.c网络, C路径af8035.c网络_路由, C路径af8035.c网络_路由_OSPF)
	c网络_路由_RIP = (C路径af8035.c网络, C路径af8035.c网络_路由, C路径af8035.c网络_路由_RIP)
	c网络_路由_BGP = (C路径af8035.c网络, C路径af8035.c网络_路由, C路径af8035.c网络_路由_BGP)
	c网络_路由_查看路由 = (C路径af8035.c网络, C路径af8035.c网络_路由, C路径af8035.c网络_路由_查看路由)
	c网络_路由_路由测试 = (C路径af8035.c网络, C路径af8035.c网络_路由, C路径af8035.c网络_路由_路由测试)
	c系统_排障_分析工具_命令行工具 = (C路径af8035.c系统, C路径af8035.c系统_排障_分析工具, C路径af8035.c系统_排障_分析工具_命令行工具)
	c系统_排障_分析工具_抓包工具 = (C路径af8035.c系统, C路径af8035.c系统_排障_分析工具, C路径af8035.c系统_排障_分析工具_抓包工具)
	c系统_排障_分析工具_技术支持工具 = (C路径af8035.c系统, C路径af8035.c系统_排障_分析工具, C路径af8035.c系统_排障_分析工具_技术支持工具)