import time
import cflw代码库py.cflw字符串 as 字符串
from ..基础接口 import 时间
from ..命令行接口 import 模式
from ..命令行接口 import 命令
#===============================================================================
# 信息
#===============================================================================
def f解析时间(a文本: str):
	"""display clock
	适用于:"""
	#15:14:12 UTC Tue 04/16/2019
	#过滤时区
	v空格位置 = 字符串.f全部找(v输出, " ")
	v行结束 = v输出.find("\n")
	if v行结束 > 0:	#如果有换行符,截取到行结束
		v输出 = v输出[0:v空格位置[0]] + v输出[v空格位置[1]:v行结束]
	else:	#如果没有换行符,截取到字符串结束
		v输出 = v输出[0:v空格位置[0]] + v输出[v空格位置[1]:]	#12:06:32 Wed 04/26/2000
	v时间 = time.strptime(v输出, "%H:%M:%S %a %m/%d/%Y")
	return v时间
#===============================================================================
# 模式
#===============================================================================
class C时间显示(时间.I时间显示, 模式.I显示模式):
	def __init__(self, a):
		时间.I时间显示.__init__(self, a)
	def f显示_时间(self):
		v命令 = "display clock"
		v输出 = self.m设备.f执行显示命令(v命令)
		return f解析时间(v输出)
