#===============================================================================
# 信息
#===============================================================================
class C设备主信息:	#2021/2/27:旧代码,需要重新验证是否可用
	"""display device maininfo
	适用于: ?"""
	def __init__(self, a输出):
		self.m输出 = a输出
	def fg型号名(self):
		pass
	def fg序列号(self):
		pass
	def fg生产日期(self):
		pass
	def fg供应商(self):
		pass
#===============================================================================
# 工具
#===============================================================================
class C配置信息:	#2021/2/27:旧代码,需要重新验证是否可用
	def __init__(self, a配置):
		self.m配置 = a配置.replace('\r', '')
	def __str__(self):
		return self.m配置
	def fg设备名称(self):
		return C输出分析.f从配置取设备名称(self.m配置)
class C输出分析:	#2021/2/27:旧代码,需要重新验证是否可用
	def f从配置取设备名称(a配置):
		v指定行 = a配置.find(" sysname ")
		v结束 = a配置.find('\n', v指定行)
		if v结束 == -1:
			return a配置[v指定行 + 9 :]
		else:
			return a配置[v指定行 + 9 : v结束]