#系统
c系统描述0 = ".1.3.6.1.2.1.1.1.0"
c系统启动时间0 = ".1.3.6.1.2.1.1.3.0"
c系统联系0 = ".1.3.6.1.2.1.1.4.0"
c系统名称0 = ".1.3.6.1.2.1.1.5.0"
c系统位置0 = ".1.3.6.1.2.1.1.6.0"
c系统服务0 = ".1.3.6.1.2.1.1.7.0"
#接口
c接口数量0 = ".1.3.6.1.2.1.2.1.0"	#ifNumber
c接口索引 = ".1.3.6.1.2.1.2.2.1.1"	#ifIndex
c接口描述 = ".1.3.6.1.2.1.2.2.1.2"	#ifDescr
c接口类型 = ".1.3.6.1.2.1.2.2.1.3"	#ifType
c接口最大传输单元 = ".1.3.6.1.2.1.2.2.1.4"	#ifMTU
c接口速率 = ".1.3.6.1.2.1.2.2.1.5"	#ifSpeed
c接口物理地址 = ".1.3.6.1.2.1.2.2.1.6"	#IfPhysAddress
c接口管理状态 = ".1.3.6.1.2.1.2.2.1.7"	#ifAdminStatus
c接口操作状态 = ".1.3.6.1.2.1.2.2.1.8"	#ifOperStatus
c接口最近变化 = ".1.3.6.1.2.1.2.2.1.9"	#ifLastChange
#网络地址4
c地址地址 = ".1.3.6.1.2.1.4.20.1.1"	#ipAdEntAddr
c地址接口索引 = "1.3.6.1.2.1.4.20.1.2"	#ipAdEntIfIndex
c地址掩码 = ".1.3.6.1.2.1.4.20.1.3"	#ipAdEntNetMask
c地址广播地址 = ".1.3.6.1.2.1.4.20.1.4"	#ipAdEntBcastAddr
c路由网络号 = ".1.3.6.1.2.1.4.21.1.1"	#ipRouteDest
c路由接口索引 = ".1.3.6.1.2.1.4.21.1.2"	#ipRouteIfIndex
c路由度量值1 = ".1.3.6.1.2.1.4.21.1.3"	#ipRouteMetric1
c路由度量值2 = ".1.3.6.1.2.1.4.21.1.4"	#ipRouteMetric2
c路由度量值3 = ".1.3.6.1.2.1.4.21.1.5"	#ipRouteMetric3
c路由度量值4 = ".1.3.6.1.2.1.4.21.1.6"	#ipRouteMetric4
c路由下一跳 = ".1.3.6.1.2.1.4.21.1.7"	#ipRouteNextHop
c路由掩码 = ".1.3.6.1.2.1.4.21.1.11"	#ipRouteMask