import cflw代码库py.cflw字符串 as 字符串
import cflw代码库py.cflw网络地址 as 地址
from ..基础接口 import 数据表
from ..基础接口 import 信息
from . import 接口 as 实现接口
def f解析速率(a速率: str):
	if "-" in a速率:
		return int(字符串.f提取字符串之间(a速率, "-", None))
	if a速率.isdigit():
		return int(a速率)
	return 0
#===============================================================================
# 接口状态表
#===============================================================================
class F接口状态_ev6(数据表.I解析表格管线):
	"""show interface status
	适用于: 浪潮cn61108pcvh(v6.2.27.13), 浪潮s5350(v6.2.27.R5.*)"""
	c标题行0 = "Port        Status     Duplex  Speed   Mode    Type                    Description  "
	c标题行1 = "------------------------------------------------------------------------------------------"
	c接口 = 0
	c状态 = 12	#链路状态
	c双工 = 23
	c速率 = 31
	c模式 = 39	#链路类型
	c类型 = 47	#以太网类型
	c描述 = 71
	ca列 = 数据表.C切割列(c接口, c状态, c双工, c速率, c模式, c类型, c描述)
	def __init__(self):
		数据表.I解析表格管线.__init__(self)
		self.f添加字段(数据表.E字段.e本端接口, self.ca列[0], 实现接口.f创建接口_ev6)
		self.f添加字段(数据表.E字段.e本端链路状态, self.ca列[1], 信息.f解析起宕状态)
		self.f添加字段(数据表.E字段.e本端双工模式, self.ca列[2], 信息.f解析双工模式)
		self.f添加字段(数据表.E字段.e本端速率, self.ca列[3], f解析速率)
		self.f添加字段(数据表.E字段.e本端描述, self.ca列[6], str)
	f初始处理 = staticmethod(数据表.F去标题行(c标题行0, c标题行1))
	fi有效行 = staticmethod(数据表.F有效长度(c描述))	
f接口状态_ev6 = F接口状态_ev6()
#===============================================================================
# 接口描述表
#===============================================================================
class F接口描述_ev6(数据表.I解析表格管线):
	"""show interface description
	适用于: 浪潮cn61108pcvh(v6.2.27.13), 浪潮s5350(v6.2.27.R5.*)"""
	c标题行0 = "Port        Status     Description"
	c标题行1 = "-----------------------------------------------------------------------------"
	c接口 = 0
	c状态 = 12
	c描述 = 23
	ca列 = 数据表.C切割列(c接口, c状态, c描述)
	def __init__(self):
		数据表.I解析表格管线.__init__(self)
		self.f添加字段(数据表.E字段.e本端接口, self.ca列[0], 实现接口.f创建接口_ev6)
		self.f添加字段(数据表.E字段.e本端链路状态, self.ca列[1], 信息.f解析起宕状态)
		self.f添加字段(数据表.E字段.e本端描述, self.ca列[2], str)
	f初始处理 = staticmethod(数据表.F去标题行(c标题行0, c标题行1))
	fi有效行 = staticmethod(数据表.F有效长度(c描述))	
f接口描述_ev6 = F接口描述_ev6()
#===============================================================================
# 接口摘要表
#===============================================================================
class F接口摘要_e580v6(数据表.I解析表格管线):
	"""show interface summary
	适用于: 浪潮cn61108pcvh(v6.2.27.13)"""
	c接口 = 0
	c状态 = 13
	c接收位秒 = 19
	c接口包秒 = 33
	c发送位秒 = 47
	c发送包秒 = 61
	ca列 = 数据表.C切割列(c接口, c状态, c接收位秒, c接口包秒, c发送位秒, c发送包秒)
	c标题行0 = "Interface    Link  RXBS          RXPS          TXBS          TXPS        "
	c标题行1 = "-----------------------------------------------------------------------------"
	def __init__(self):
		数据表.I解析表格管线.__init__(self)
		self.f添加字段(数据表.E字段.e本端接口, self.ca列[0], 实现接口.f创建接口_ev6)
		self.f添加字段(数据表.E字段.e本端链路状态, self.ca列[1], 信息.f解析起宕状态)
		self.f添加字段(数据表.E字段.e本端每秒发送比特数, self.ca列[2], int)
		self.f添加字段(数据表.E字段.e本端每秒发送包数, self.ca列[3], int)
		self.f添加字段(数据表.E字段.e本端每秒接收比特数, self.ca列[4], int)
		self.f添加字段(数据表.E字段.e本端每秒接收包数, self.ca列[5], int)
	f初始处理 = staticmethod(数据表.F去标题行(c标题行0, c标题行1))
	fi有效行 = staticmethod(数据表.F有效长度(c发送包秒))
f接口摘要_e580v6 = F接口摘要_e580v6()
class F接口摘要_e530v6(数据表.I解析表格管线):
	"""show interface summary
	适用于: 浪潮s5350(v6.2.27.R5.*)"""
	c标题行0 = "Interface    Link     RXBS          RXPS          TXBS          TXPS        "
	c标题行1 = "-----------------------------------------------------------------------------"
	c接口 = 0
	c状态 = 13
	c接收位秒 = 22
	c接口包秒 = 36
	c发送位秒 = 50
	c发送包秒 = 64
	ca列 = 数据表.C切割列(c接口, c状态, c接收位秒, c接口包秒, c发送位秒, c发送包秒)
	def __init__(self):
		数据表.I解析表格管线.__init__(self)
		self.f添加字段(数据表.E字段.e本端接口, self.ca列[0], 实现接口.f创建接口_ev6)
		self.f添加字段(数据表.E字段.e本端链路状态, self.ca列[1], 信息.f解析起宕状态)
		self.f添加字段(数据表.E字段.e本端每秒发送比特数, self.ca列[2], int)
		self.f添加字段(数据表.E字段.e本端每秒发送包数, self.ca列[3], int)
		self.f添加字段(数据表.E字段.e本端每秒接收比特数, self.ca列[4], int)
		self.f添加字段(数据表.E字段.e本端每秒接收包数, self.ca列[5], int)
	f初始处理 = staticmethod(数据表.F去标题行(c标题行0, c标题行1))
	fi有效行 = staticmethod(数据表.F有效长度(c发送包秒))
f接口摘要_e530v6 = F接口摘要_e530v6()
#===============================================================================
# 网络接口表4
#===============================================================================
class F网络接口表4_ev6(数据表.I解析表格管线):
	"""show ip interface brief
	适用于: 浪潮cn61108pcvh(v6.2.27.13), 浪潮s5350(v6.2.27)"""
	c接口 = 0
	c地址 = 22
	c状态 = 38
	c协议 = 62
	ca列 = 数据表.C切割列(c接口, c地址, c状态, c协议)
	c标题行0 = "Interface             IP-Address      Status                  Protocol"
	def __init__(self):
		数据表.I解析表格管线.__init__(self)
		self.f添加字段(数据表.E字段.e本端接口, self.ca列[0], 实现接口.f创建接口_ev6)
		self.f添加字段(数据表.E字段.e本端网络地址4, self.ca列[1], lambda x: 地址.S网络地址4.fc主机地址字符串(x) if "." in x else None)
		self.f添加字段(数据表.E字段.e本端链路状态, self.ca列[2], 信息.f解析起宕状态)
		self.f添加字段(数据表.E字段.e本端协议状态, self.ca列[3], 信息.f解析起宕状态)
	f初始处理 = staticmethod(数据表.F去标题行(c标题行0))
f网络接口表4_ev6 = F网络接口表4_ev6()
#===============================================================================
# 地址解析协议
#===============================================================================
class F地址解析协议_ev6(数据表.I解析表格管线):
	"""show ip arp
	适用于: 浪潮cn61108pcvh(v6.2.27.13), 浪潮s5350(v6.2.27.R5.*)"""
	c标题行 = " Protocol    Address          Age (min)  Hardware Addr   Interface "
	c协议 = 0
	c网络地址 = 13
	c寿命 = 35
	c物理地址 = 41
	c接口 = 57
	ca列 = 数据表.C切割列(c协议, c网络地址, c寿命, c物理地址, c接口)
	def __init__(self):
		数据表.I解析表格管线.__init__(self)
		self.f添加字段(数据表.E字段.e对端网络地址4, self.ca列[1], 地址.S网络地址4.fc主机地址字符串)
		self.f添加字段(数据表.E字段.e本端寿命, self.ca列[2], lambda x: int(x) * 60)
		self.f添加字段(数据表.E字段.e对端物理地址, self.ca列[3], 地址.S物理地址.fc字符串)
		self.f添加字段(数据表.E字段.e本端接口, self.ca列[4], 实现接口.f创建接口_ev6)
	f初始处理 = staticmethod(数据表.F去标题行(c标题行))
	@staticmethod
	def fi有效行(a行: str):
		if "-" in a行:	#地址是本端地址时,寿命为-
			return False
		return True
f地址解析协议_ev6 = F地址解析协议_ev6()
#===============================================================================
# 物理地址表
#===============================================================================
class F物理地址表_ev6(数据表.I解析表格管线):
	"""show mac address-table
	适用于: 浪潮cn61108pcvh(v6.2.27.13), 浪潮s5350(v6.2.27.R5.*)"""
	c标题行0 = "Vlan    Mac Address       Type        Ports"
	c标题行1 = "----    -----------       --------    -----"
	c虚拟局域网 = 0
	c物理地址 = 8
	c类型 = 26
	c端口 = 38
	ca列 = 数据表.C切割列(c虚拟局域网, c物理地址, c类型, c端口)
	def __init__(self):
		数据表.I解析表格管线.__init__(self)
		self.f添加字段(数据表.E字段.e本端虚拟局域网, self.ca列[0], int)
		self.f添加字段(数据表.E字段.e对端物理地址, self.ca列[1], 地址.S物理地址.fc字符串)
		self.f添加字段(数据表.E字段.e对端物理地址类型, self.ca列[2], 信息.ca物理地址类型.get)
		self.f添加字段(数据表.E字段.e本端接口, self.f取接口, 实现接口.f创建接口_ev6)
	f取接口列 = staticmethod(ca列[3])
	f初始处理 = staticmethod(数据表.F去标题行(c标题行0, c标题行1))
	def f取接口(self, a行: str)->str:
		#接口后面可能带括号,需要去除
		v接口s = self.f取接口列(a行)
		v括号位置 = v接口s.find("(")
		if v括号位置 == -1:
			return v接口s
		else:
			return v接口s[:v括号位置]
f物理地址表_ev6 = F物理地址表_ev6()