import cflw代码库py.cflw字符串 as 字符串
import cflw代码库py.cflw网络地址 as 地址
from ..基础接口 import 数据表
from ..基础接口 import 信息
from . import 接口 as 实现接口
#===============================================================================
# 接口表
#===============================================================================
def f接口表(a文本: str):
	"""show management interface
	适用于: 浪潮s5350(v6.2.*)"""
#===============================================================================
# 网络接口表
#===============================================================================
def f网络接口表4(a文本: str):
	"""show management ip address
	适用于: 浪潮s5350(v6.2.*)"""
def f网络接口表6(a文本: str):
	"""show management ipv6 address
	适用于: """
	raise NotImplementedError()
#===============================================================================
# 地址解析表
#===============================================================================
class F地址解析表(数据表.I解析表格管线):
	"""show management arp
	适用于: 浪潮s5350(v6.2.*)"""
#===============================================================================
# 路由表
#===============================================================================
def f路由表4(a文本: str):
	"""show management ip address 构造vrf=mgmt-if的路由
	适用于: 浪潮s5350(v6.2.*)"""
