import enum
import cflw代码库py.cflw工具 as 工具
#===============================================================================
# 工厂
#===============================================================================
class E型号(enum.IntEnum):
	sm4100 = 4100
	sm4120 = 4120
	t6100 = 6100
def f创建设备(a连接, a型号, a版本 = 0):
	if not a版本:	#根据型号判断默认版本
		if a版本 in (E型号.sm4100, E型号.sm4120):
			a版本 = 6
		elif a版本 in (E型号.t6100,):
			a版本 = 9
		else:
			raise ValueError("无法识别的型号")
	else:	#解析版本
		v版本 = 工具.S版本号.fc自动(a版本)
	from .迈普命令行 import 设备
	if v版本 >= 9:	#9.x
		return 设备.C设备_v9(a连接, a型号, a版本)
	else:	#6.x
		return 设备.C设备(a连接, a型号, a版本)
