import time
import cflw代码库py.cflw字符串 as 字符串
from ..基础接口 import 时间
from ..命令行接口 import 模式
#===============================================================================
# 信息
#===============================================================================
def f解析时间v7(a文本: str):
	"""display clock
	适用于: 紫光s8600x(v7.1.070)"""
	#18:45:28.404 UTC Sat 08/13/2022
	#过滤毫秒,时区,星期
	v空格位置 = 字符串.f全部找(a文本, " ")
	v时间s = a文本[0:v空格位置[0]-4] + a文本[v空格位置[2]:]	#18:45:28 08/13/2022
	v时间 = time.strptime(v时间s, "%H:%M:%S %m/%d/%Y")
	return v时间
#===============================================================================
# 模式
#===============================================================================
class C时间显示v7(时间.I时间显示, 模式.I显示模式):
	def __init__(self, a):
		模式.I显示模式.__init__(self, a)
	def f显示_时间(self):
		v命令 = "display clock"
		v输出 = self.m设备.f执行显示命令(v命令)
		return f解析时间v7(v输出)
