import time
import cflw代码库py.cflw字符串 as 字符串
from ..基础接口 import 时间
from ..命令行接口 import 模式
from ..命令行接口 import 显示
from ..华三命令行 import 时间 as 旧时间
#===============================================================================
# 信息
#===============================================================================
def f解析时间_v7(a文本: str):
	"""display clock
	适用于: 紫光s5200(v7.1.*)"""
	#18:45:28.404 UTC Sat 08/13/2022
	#过滤毫秒,时区,星期
	v空格位置 = 字符串.f全部找(a文本, " ")
	v时间s = a文本[0:v空格位置[0]-4] + a文本[v空格位置[2]:]	#18:45:28 08/13/2022
	v时间 = time.strptime(v时间s, "%H:%M:%S %m/%d/%Y")
	return v时间
def f解析时间_s7v7(a文本: str):
	"""display clock
	适用于: 华三s5560x(v7.1.070), 紫光s8600x(v7.1.070)"""
	#14:24:27.322 UTC Sun 12/03/2023
	#Time Zone : UTC add 08:00:00
	v行 = 字符串.f提取第几行(a文本, 0)
	return f解析时间_v7(v行)
def f解析时间_s9v7(a文本: str):
	"""display clock
	适用于: 华三s9810(v7.1.045)"""
	#18:57:43 Beijing Sun 12/03/2023
	#Time Zone : Beijing add 08:00:00
	v行 = 字符串.f提取第几行(a文本, 0)
	return 旧时间.f解析时间(v行)
#===============================================================================
# 模式
#===============================================================================
c命令_时间 = "display clock"
class C时间显示_v7(时间.I时间显示, 模式.I显示模式):
	def __init__(self, a):
		模式.I显示模式.__init__(self, a)
	f显示_时间 = 显示.F显示并解析(c命令_时间, f解析时间_v7)
class C时间显示_s7v7(C时间显示_v7):
	"""适用于: 华三s5560x(v7.1.070), 紫光s8600x(v7.1.*)"""
	f显示_时间 = 显示.F显示并解析(c命令_时间, f解析时间_s7v7)
class C时间显示_s9v7(C时间显示_v7):
	"""适用于: 华三s9810(v7.1.045)"""
	f显示_时间 = 显示.F显示并解析(c命令_时间, f解析时间_s9v7)
