from ..基础接口 import 信息
from ..基础接口 import 数据表
from ..基础接口 import 硬件
#===============================================================================
# 风扇
#===============================================================================
ca风扇方向 = {
	"Port-to-power": 硬件.E风扇方向.e从前到后,
}
class F风扇信息(数据表.I解析列表管线):
	"""display fan
	适用于: 华三s6900(v7.1.070)"""
#===============================================================================
# 电源
#===============================================================================
ca电源风扇方向 = {
	"PortToPower": 硬件.E风扇方向.e从前到后,
}
class F电源信息(数据表.I解析表格管线):
	"""display power
	适用于: 华三s6900(v7.1.070)"""
	c标识 = 0
	c状态 = 9
	c模式 = 23
	c电流 = 30
	c电压 = 42
	c功率 = 54
	c风扇方向 = 64
	ca列 = 数据表.C切割列(c标识, c状态, c模式, c电流, c电压, c功率, c风扇方向)
	c标题行0 = " PowerID State         Mode   Current(A)  Voltage(V)  Power(W)  FanDirection"
	def __init__(self):
		数据表.I解析表格管线.__init__(self)
		self.f添加字段(数据表.E字段.e本端索引, self.ca列[0], int)
		self.f添加字段(数据表.E字段.e本端电源状态, self.ca列[1], lambda x: "Normal" in x)
		self.f添加字段(数据表.E字段.e本端索引, self.ca列[0], int)
		self.f添加字段(数据表.E字段.e本端索引, self.ca列[0], int)
		self.f添加字段(数据表.E字段.e本端索引, self.ca列[0], int)
		self.f添加字段(数据表.E字段.e本端索引, self.ca列[0], int)
		self.f添加字段(数据表.E字段.e本端索引, self.ca列[0], int)

#===============================================================================
# 温度
#===============================================================================
class F温度信息(数据表.I解析表格管线):
	"""display enviroment
	适用于: 华三s6900(v7.1.070)"""
	c标题行0 = " Slot  Sensor    Temperature  Lower  Warning  Alarm  Shutdown"
