import cflw代码库py.cflw网络连接 as 连接
import cflw代码库py.cflw网络连接_视窗 as 视窗连接
import 网络设备脚本 as 脚本
import 网络设备脚本.思科 as 思科
import 网络设备脚本.华为 as 华为
import 网络设备脚本.华三 as 华三
def f连接(a连接):
	v设备 = 思科.f创建设备(a连接, 思科.E型号.c7200, 15.0)
	# v设备 = 华为.f创建设备(a连接, 华为.E型号.ar3260, 5.130)
	# v设备 = 华三.f创建设备(v连接, 华三.E型号.msr3620, 7.1)
	v设备.fs回显(True)
	v用户 = v设备.f模式_用户()
	v用户.f登录(a用户名 = "asdf", a密码 = "1234")
	v用户.f提升权限(a密码 = "123456")
	return v设备, v用户
def main():
	v连接1 = 连接.C网络终端("gns3.localhost", 5000)
	# v连接1 = 连接.C网络终端("ensp.localhost", 2000)
	# v连接1 = 视窗连接.C命名管道(r"\\.\pipe\topo1-device1")
	v设备1, v用户模式1 = f连接(v连接1)
	v全局配置1 = v用户模式1.f模式_全局配置()

	v设备2, v用户模式2 = f连接(v用户模式1.f连接_网络终端("12.0.0.2"))
	v全局配置2 = v用户模式2.f模式_全局配置()

	v设备3, v用户模式3 = f连接(v用户模式2.f连接_网络终端("23.0.0.3"))
	v全局配置3 = v用户模式3.f模式_全局配置()

	v全局配置1.fs设备名("r1")
	v全局配置2.fs设备名("r2")
	v全局配置3.fs设备名("r3")

if __name__ == "__main__":
	main()